<a href="https://colab.research.google.com/github/Farhana-afrin/Python_Classwork/blob/main/Lecture_06_Python_ML.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#### Lecture 06

In [ ]:
import pandas as pd

In [ ]:
df_A=pd.DataFrame()
df_A['Name']=['A','B','C']
df_A['Address']=['Houston','Boise','Tampa']
df_A['University']=['USF','BSU','USF']
print(type(df_A))
display(df_A)
print(df_A.shape)

  Name  Address University
0    A  Houston        USF
1    B    Boise        BSU
2    C    Tampa        USF

(3, 3)

In [ ]:
df_B=pd.DataFrame({'Name':['A','B','D'],'Department':['EEE','CSE','EEE'],'Address':['Texas','Idaho','Dhaka']})

print(type(df_B))
display(df_B)
print(df_B.shape)

<class 'pandas.core.frame.DataFrame'>

  Name Department Address
0    A        EEE   Texas
1    B        CSE   Idaho
2    D        EEE   Dhaka

(3, 3)

Inner Join

In [ ]:
df_inner_e1=df_A.merge(df_B,how='inner',on=['Name'],suffixes=['_L','_R'])
display(df_inner_e1)
df_inner_e2=df_A.merge(df_B,how='inner',on=['Address'])
display(df_inner_e2)

  Name Address_L University Department Address_R
0    A   Houston        USF        EEE     Texas
1    B     Boise        BSU        CSE     Idaho

Empty DataFrame
Columns: [Name_x, Address, University, Name_y, Department]
Index: []

In [ ]:
df_inner_e1=df_A.merge(df_B,how='left',on=['Name'],suffixes=['_L','_R'])
display(df_inner_e1)

  Name Address_L University Department Address_R
0    A   Houston        USF        EEE     Texas
1    B     Boise        BSU        CSE     Idaho
2    C     Tampa        USF        NaN       NaN

In [ ]:
df_right_e1=df_A.merge(df_B,how='right',on=['Name'],suffixes=['_L','_R'])
display(df_right_e1)

  Name Address_L University Department Address_R
0    A   Houston        USF        EEE     Texas
1    B     Boise        BSU        CSE     Idaho
2    D       NaN        NaN        EEE     Dhaka

In [ ]:
df_outer_e1=df_A.merge(df_B,how='outer')
display(df_outer_e1)

  Name  Address University Department
0    A  Houston        USF        NaN
1    B    Boise        BSU        NaN
2    C    Tampa        USF        NaN
3    A    Texas        NaN        EEE
4    B    Idaho        NaN        CSE
5    D    Dhaka        NaN        EEE